<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Region;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RegionCitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $regions = [
            'Алматы' => ['Алматы'],
            'Астана' => ['Астана'],
            'Абайская область' => ['Семей', 'Аягоз'],
            'Актюбинская область' => ['Актобе', 'Каракудук'],
            'Алматинская область' => ['Каскелен', 'Конаев', 'Талгар'],
            'Акмолинская область' => ['Кокшетау', 'Щучинск'],
            'Атырауская область' => ['Атырау', 'Кульсары'],
            'Восточно-Казахстанская область' => ['Риддер', 'Усть-Каменогорск'],
            'Жамбылская область' => ['Тараз'],
            'Жетысу область' => ['Талдыкорган'],
            'Западно-Казахстанская область' => ['Аксай', 'Уральск'],
            'Карагандинская область' => ['Балхаш', 'Караганда', 'Темиртау', 'Шахтинск'],
            'Костанайская область' => ['Костанай', 'Лисаковск', 'Рудный'],
            'Кызылординская область' => ['Байконур', 'Кызылорда'],
            'Мангистауская область' => ['Актау', 'Бейнеу', 'Жанаозен'],
            'Павлодарская область' => ['Павлодар', 'Экибастуз'],
            'Северо-Казахстанская область' => ['Петропавловск'],
            'Туркестанская область' => ['Туркестан'],
            'Улытауская область' => ['Жезказган', 'Сатпаев'],
        ];

        foreach ($regions as $regionName => $cities) {
            $region = Region::create(['name' => $regionName]);
            foreach ($cities as $cityName) {
                City::create([
                    'name' => $cityName,
                    'region_id' => $region->id
                ]);
            }
        }
    }
}
